**SQL Data Types**
* INT :- Store whole number(e.g 123 , -456)
  * TINYINT
    * signed or unsigned 8 bit integers
    * maximu length - 1 byte
  * SMALLINT
    * signed or unsigned 16 bit integers
    * maximum length - 2 bytes
  * MEDIUMINT
    * signed or unsigned integers (20-bit on most system)
    * maximum length - 3 byte
  * INT
    * signed or unsigned 32 bit integers
    * maximum length - 4 bytes
  * BIGINT
    * signed or unsigned 64 bit integers
    * maximum length - 8 bytes

* FLOAT :- Stores decimal numbers (e.g 3.14, -2.76)
  * DECIMAL(m,d)
    * stores fixed point decimal numbers with m total digits and d decimal places, decimal(5,2) => 485.72
  * FLOAT
    * stores single-precision floating point numbers(4 bytes)
    * Single precision uses 32 bits of memory
    * Single precision represents numbers with approximately 7 decimal digits of precision. It means small variations in the actial value may be lost when storing it in this format.
  * DOUBLE
    * stores double-precision floating point numbers(8 bytes)
    * Double precision uses 64 bits of memory
    * Double precision represents numbers with approximately 15-16 decimal digits of precision. It provides higher accuracy comapred to single precision.

* Characters
  * char(n)
    * fix length character string upto n characters
    * char(8) => h e l l o _ _ _
  * varchar(n)
    * variable length character string upto n characters
    * varchar(20) => h e l l o
  * text
    * variable length text string, maximum length system dependent
    * text stores data including letters, symbols and punctuations
  * blob
    * Binary large objects (variable length)
    * blob - stores binary data, which can be any type represented in series of bytes including images, audios, videos, documents or any other non-textual content

* Date and Time Types
  * DATE
    * date values - Maximum length -> 3 bytes
    * format - YYYY-MM-DD
  * TIME
    * Time values - Maximum length -> 3 bytes
  * DATETIME
    * Combination of date and time - Maximum length -> 8 bytes
    * format - YYYY-MM-DD hh:mm:ss
  * TIMESTAMP
    * Date and time with automatic time-stamping on update
    * Maximum length - 4 bytes.

* BOOLEAN Type
    * Represents True or False, Maximum length - 1 byte

****

* create table students (students_id int, name varchar(40) , email varchar(50), age int);

* show tables;

* describe students;

* insert into students (students_id,name,email,age) values (1,'Pavan','pavan@abc.com',20);

* insert into students (students_id,name,email,age) values (2,'Ajay','ajay@abc.com',18);

* insert into students (students_id,name,email,age) values (2,'John','john@abc.com',19);

* select * from students;

****
**SQL Integrity Constraints**
  * Primary Key
    * uniquely identifies each row in a table (e.g. book id)
    * Not allows null values
  * Foreign Key
    * Links a table to another table (e.g. author_id in books links author_id in authors)
  * NOT NULL
    * Prevents a column from having Null Values (e.g title in books)
  * UNIQUE
    * Prevents duplicate values in a specific columns
    * Allow null values

*****
* create table new_students (student_id int primary key, name varchar(20) , email varchar(30) unique, age int not null);

* describe new_students;

* insert into new_students (student_id,name,email,age) values (1,'Joy','joy@abc.com',16);

* insert into new_students (student_id,name,email,age) values (1,'John','john@abc.com',17); => error as student_id can't be same being a primary key

* insert into new_students (student_id,name,email,age) values (2,'John','john@abc.com',17);

* insert into new_students (student_id,name,email,age) values (3,'Ajay','john@abc.com',19); => error as email id can't be same for two entries but can be blank

* insert into new_students (student_id,name,age) values (3,'Ajay',19);

* insert into new_students (name,age) values ('Ajay',19); => error as student_id can't be blank and same being a primary key

* insert into new_students (student_id,name) values (3,'Ajay'); => error as age value is missing and we used not null constraint for age column

* insert into new_students (student_id,name,age) values (4,'abhay',19);

* select * from new_students;